export const HOLIDAYS: Record<string, string> = {
  '2025-01-01':'วันขึ้นปีใหม่','2025-02-12':'วันมาฆบูชา','2025-04-06':'วันจักรี',
  '2025-04-13':'วันสงกรานต์','2025-04-14':'วันสงกรานต์','2025-04-15':'วันสงกรานต์',
  '2025-05-01':'วันแรงงานแห่งชาติ','2025-05-05':'วันฉัตรมงคล','2025-05-11':'วันวิสาขบูชา',
  '2025-06-03':'วันเฉลิมฯ พระราชินี','2025-07-10':'วันอาสาฬหบูชา','2025-07-11':'วันเข้าพรรษา',
  '2025-07-28':'วันเฉลิมฯ ร.10','2025-08-12':'วันแม่แห่งชาติ','2025-10-13':'วันคล้ายวันสวรรคต ร.9',
  '2025-10-23':'วันปิยมหาราช','2025-12-05':'วันพ่อแห่งชาติ','2025-12-10':'วันรัฐธรรมนูญ',
  '2025-12-31':'วันสิ้นปี',
  '2026-01-01':'วันขึ้นปีใหม่','2026-01-02':'ชดเชยวันขึ้นปีใหม่','2026-03-03':'วันมาฆบูชา',
  '2026-04-06':'วันจักรี','2026-04-13':'วันสงกรานต์','2026-04-14':'วันสงกรานต์',
  '2026-04-15':'วันสงกรานต์','2026-05-01':'วันแรงงานแห่งชาติ','2026-05-05':'วันฉัตรมงคล',
  '2026-05-31':'วันวิสาขบูชา','2026-06-03':'วันเฉลิมฯ พระราชินี','2026-07-28':'วันเฉลิมฯ ร.10',
  '2026-07-29':'วันอาสาฬหบูชา','2026-07-30':'วันเข้าพรรษา','2026-08-12':'วันแม่แห่งชาติ',
  '2026-10-13':'วันคล้ายวันสวรรคต ร.9','2026-10-23':'วันปิยมหาราช','2026-12-05':'วันพ่อแห่งชาติ',
  '2026-12-10':'วันรัฐธรรมนูญ','2026-12-31':'วันสิ้นปี',
}

export const TH_MONTHS = ['มกราคม','กุมภาพันธ์','มีนาคม','เมษายน','พฤษภาคม','มิถุนายน',
                          'กรกฎาคม','สิงหาคม','กันยายน','ตุลาคม','พฤศจิกายน','ธันวาคม']
export const TH_DAYS = ['อา','จ','อ','พ','พฤ','ศ','ส']
